# BuiltInFailures.SiteFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures Class
BuiltInFailures Class Members See Also
---
Failures about Site.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SiteFailures
```

Visual Basic
---
```text
Public NotInheritable Class SiteFailures
```

Visual C++
---
```text
public ref class SiteFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SiteFailures
# See Also
BuiltInFailures..::..SiteFailures Members
Autodesk.Revit.DB Namespace